share/tutorials/electromagnetics/mhd/hartmann/system/blockMeshDict
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      blockMeshDict;
}

convertToMeters 1;
vertices
(
  (0 -1 0)
  (20 -1 0)
  (20 1 0)
  (0 1 0)
  (0 -1 0.1)
  (20 -1 0.1)
  (20 1 0.1)
  (0 1 0.1)
);
blocks
(
  hex (0 1 2 3 4 5 6 7) (100 40 1) simpleGrading (1 1 1)
);
edges
(
);
boundary
(
  inlet
  {
    type patch;
    faces
    (
      (0 4 7 3)
    );
  }
  outlet
  {
    type patch;
    faces
    (
      (2 6 5 1)
    );
  }
  lowerWall
  {
    type patch;
    faces
    (
      (1 5 4 0)
    );
  }
  upperWall
  {
    type patch;
    faces
    (
      (3 7 6 2)
    );
  }
  frontAndBack
  {
    type empty;
    faces
    (
      (0 3 2 1)
      (4 5 6 7)
    );
  }
);
mergePatchPairs
(
);

// vim: set ft=foam et sw=2 ts=2 sts=2:
