share/tutorials/electromagnetics/mhd/hartmann/constant/transportProperties
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "constant";
  object      transportProperties;
}

rho             [1 -3 0 0 0 0 0] 1;
nu              [0 2 -1 0 0 0 0] 1;
mu              [1 1 -2 0 0 -2 0] 1;
sigma           [-1 -3 3 0 0 2 0] 1;

// vim: set ft=foam et sw=2 ts=2 sts=2:
