share/tutorials/electromagnetics/mhd/hartmann/0/B
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volVectorField;
  object      B;
}

dimensions      [1 0 -2 0 0 -1 0];
internalField   uniform (0 20 0);

boundaryField
{
  inlet
  {
    type            zeroGradient;
  }
  outlet
  {
    type            zeroGradient;
  }
  lowerWall
  {
    type            fixedValue;
    value           uniform (0 20 0);
  }
  upperWall
  {
    type            fixedValue;
    value           uniform (0 20 0);
  }
  frontAndBack
  {
    type            empty;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
