share/tutorials/electromagnetics/mhd/hartmann/0/Uy
// -*- c++ -*-
// mousse: CFD toolbox (v.0.1.0)
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Uy;
}
// ---

dimensions [0 1 -1 0 0 0 0];

internalField uniform 0;

boundaryField
{
  inlet
  {
    type calculated;
    value uniform 0;
  }
  outlet
  {
    type calculated;
    value uniform 0;
  }
  lowerWall
  {
    type calculated;
    value uniform 0;
  }
  upperWall
  {
    type calculated;
    value uniform 0;
  }
  frontAndBack
  {
    type empty;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
