share/tutorials/electromagnetics/mhd/hartmann/0/pB
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  object      pB;
}

dimensions      [1 1 -3 0 0 -1 0];
internalField   uniform 0;

boundaryField
{
  inlet
  {
    type            fixedValue;
    value           uniform 0;
  }
  outlet
  {
    type            fixedValue;
    value           uniform 0;
  }
  lowerWall
  {
    type            zeroGradient;
  }
  upperWall
  {
    type            zeroGradient;
  }
  frontAndBack
  {
    type            empty;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
