share/tutorials/electromagnetics/mhd/hartmann/system/fvSchemes
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      fvSchemes;
}

ddtSchemes
{
  default         Euler;
}
gradSchemes
{
  default         Gauss linear;
}
divSchemes
{
  default         none;
  div(phi,U)      Gauss linear;
  div(phiB,U)     Gauss linear;
  div(phi,B)      Gauss linear;
  div(phiB,((2*DBU)*B)) Gauss linear;
}
laplacianSchemes
{
  default         Gauss linear corrected;
}
interpolationSchemes
{
  default         linear;
}
snGradSchemes
{
  default         corrected;
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
