share/tutorials/electromagnetics/mhd/hartmann/system/sampleDict
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      sampleDict;
}

interpolationScheme cellPoint;
setFormat       raw;
sets
(
  line_centreProfile
  {
    type    uniform;
    axis    distance;
    start   (10.001 -1 0.01);
    end     (10.001 1 0.01);
    nPoints 100;
  }
);
fields          ( Ux );

// vim: set ft=foam et sw=2 ts=2 sts=2:
